[
    {
        "name": "Garlic Chili Oil Noodles",
        "ingredients": "1 package ramen noodles, 2 teaspoons sesame oil, 2 teaspoons soy sauce, 1 tablespoon chiu chow style chili oil, 4 cloves garlic, minced, 1 pinch black sesame seeds, 2 green onions, sliced diagonally, or to taste",
        "directions": "Bring a pot of water to a boil over high heat. Add ramen noodles, and cook until tender, 3 to 4 minutes. Meanwhile, heat sesame oil, soy sauce, and chili oil in a wok over medium-high heat. Add garlic and stir fry until fragrant, 30 to 45 seconds. Remove from heat. Drain ramen noodles, add to the wok, and toss to coat. Sprinkle with sesame seeds and scallions for garnish. Enjoy!",
        "cook_time": "10 mins",
        "comments": "I buy my ramen at a local Asian market. It comes in a pack of 5 without seasoning packets. If yours comes with seasoning packets, discard them.",
        "image_url": "https://www.allrecipes.com/thmb/b7Yx82xB4yNj-2rkcK2VvcIwaZ8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7496389_Garlic-Chili-Oil-Noodles_TheDailyGourmet_4x3-4f3f998ed52d44819901e524e0311722.jpg"
    },
    {
        "name": "Crockpot Italian Chicken",
        "ingredients": "1 (16 ounce) bottle Italian dressing (such as Olive Garden℠ Signature Italian Dressing), 1/4 cup grated Parmesan cheese, 4 boneless skinless chicken breasts",
        "directions": "Stir Italian dressing and Parmesan cheese together in a bowl. Place chicken in a slow cooker, and pour dressing mixture over chicken. Cover and cook on Low until chicken is tender, no longer pink in the center, and the juices run clear, about 8 hours.",
        "cook_time": "8 hrs 5 mins",
        "comments": "",
        "image_url": "https://www.allrecipes.com/thmb/cLLmeWO7j9YYI66vL3eZzUL_NKQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/7501402crockpot-italian-chicken-recipe-fabeveryday4x3-223051c7188841cb8fd7189958c62f3d.jpg"
    },
    {
        "name": "Pan-Fried Pork Chops",
        "ingredients": "4 boneless pork chops, 3/4-inch thick, salt and freshly ground black pepper to taste, 2 tablespoons all-purpose flour, ½ cup cooking oil",
        "directions": "Do not pat chops dry, so seasonings and flour will stick. Season both sides of pork chops with salt and pepper, then sprinkle with flour on both sides. Use the back of a spoon to distribute the flour over the entire surface. Heat oil in a 12-inch non-stick skillet over medium heat until it shimmers. Carefully add pork chops and pan fry until brown, about 4 minutes. Do not disturb the chops until ready to turn. When you see the edges of the chops turn brown, turn, and pan fry the other side until no longer pink on the inside and brown on the outside, an additional 4 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Reduce heat, if they are browning too quickly. Serve warm.",
        "cook_time": "15 mins",
        "comments": "You can season the pork chops the way your family likes them the best! Garlic salt, onion salt, or any seasoned salt may be used, if desired. Dried herbs may be added to the flour, for extra flavor. Thicker chops will take longer to cook, thinner chops will take less time. Use a meat thermometer and do not overcook.",
        "image_url": "https://www.allrecipes.com/thmb/_VtMa02pmLKwCx3GT-nwN50yyvo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Pan-Fried-Breaded-Pork-Chops-14321b3ad9c542d5a437801fd76c88c1.jpeg"

    },
    {
        "name": "Honey Glazed Chicken",
        "ingredients": "¼ cup honey, 2 tablespoons soy sauce, ⅛ teaspoon red pepper flakes, 1 ½ tablespoons olive oil, 2 skinless, boneless chicken breast halves, cut into bite-size pieces",
        "directions": "Gather all ingredients. Whisk honey, soy sauce, and red pepper flakes in a bowl; set aside. Heat olive oil in a skillet over medium heat; cook and stir chicken in hot oil until lightly brown, about 5 minutes. Pour honey mixture into the skillet; continue to cook and stir until chicken is no longer pink in the center and sauce is thickened, about 5 minutes more. Serve hot and enjoy!",
        "cook_time": "20 mins",
        "comments": "",
        "image_url": "https://www.allrecipes.com/thmb/AhQLcq-BHeoRO4EGdnw941Z_w0A=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/231939_Honey-Glazed-Chicken_Adam-Vaccarezza_4564886_original-4x3-1-acb1de801b6541b69e06bf7b731c1b60.jpg"
    },
    {
        "name": "Sweet and Sour Pork Stir Fry",
        "ingredients": "1 pound pork loin cut into bite-sized pieces,1 tablespoon Chinese five-spice powder,¼ cup vegetable oil, ½ red bell pepper cut into bite-sized pieces, ½ yellow bell pepper, cut into bite-sized pieces,½ orange bell pepper, ½ red onion, cut into bite-sized piece,¼ cup sweet and sour sauce",
        "directions": "Place pork in a bowl, season with Chinese five-spice powder and mix well.Heat 2 tablespoons oil in a wok over high heat; stir-fry pork until slightly pink in the center, about 5 minutes; remove pork to a plate. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).Add remaining 2 tablespoons oil to wok as needed; stir-fry red, orange, and yellow bell peppers with onion and garlic until crisp-tender, 3 to 5 minutes. Stir in broccoli and pineapple; stir-fry for 3 minutes more.Stir pork and sweet and sour sauce into wok; stir-fry until pineapple is lightly browned, about 2 minutes.",
        "cook_time": "15 mins",
        "comments": "Use high heat!",
        "image_url": "https://www.allrecipes.com/recipe/8543965/sweet-and-sour-pork-stir-fry/"
    },
    {
        "name": "Christmas Morning Spiced Bread",
        "ingredients": "450g strong white bread flour, 1 tsp salt, 2 tsp ground cinnamon, 85g light muscovado sugar, 2 tsp easy-blend yeast, 200ml full-fat milk, 50g unsalted butter, 2 medium eggs, 50g walnut pieces, 85g raisins, 1 egg yolk",
        "directions": "Put the mixed fruit, cherries, mixed peel, carrot, and lemon and orange zest in a bowl with the sugar and spice. Pour in the lemon juice and alcohol, and stir really well. Cover and leave to soak overnight. Heat oven to 160C/140C fan/gas 3 and put a full kettle of water on to boil. Grease a 1.5-litre pudding basin and put a disc of baking parchment in the base. Stir the eggs into the fruit mixture, then stir in the chopped nuts, flour and breadcrumbs. Finally, grate in the frozen butter, stirring the mixture frequently so that it evenly disperses. For the topping, mix the soft butter and golden syrup together, and spread over the bottom of the basin. Pile in the whole cherries, orange segments and whole nuts, breaking the pecans in half as you add them. Try not to just make a thick layer of fruit and nuts on the base ease some up the side too. Spoon in the pudding mixture and level the top, then cover with baking parchment and foil. Tie the top with string or an extra-large rubber band, then place in a roasting tin and pour in the water from the kettle. Cover the whole thing with a tent of foil to seal in all the steam, then place in the oven for 6 hrs. This gives a light pudding, so if you prefer a darker one, cook for up to 8 hrs. Will keep in the fridge for 1 month. If you want it to last longer, omit the orange segments.",
        "cook_time": "7 hrs",
        "comments": "make the day before.",
        "image_url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-2553_12-53755d5.jpg?quality=90&webp=true&resize=440,400"
    },
    {
        "name": "Baked Brie with Honey, Pecans, and Cranberries",
        "ingredients": "1 (8 ounce) wheel Brie cheese,2 tablespoons honey, 1 ½ tablespoons toasted chopped pecans, 1 ½ tablespoons dried cranberries,  ½ teaspoon minced fresh rosemary",
        "directions": "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. Unwrap Brie; place on the prepared baking sheet. Bake in the preheated oven until cheese feels soft, but not completely melted, when you press the center of the wheel with your thumb, 8 to 10 minutes.Drizzle honey over Brie on a serving plate, sprinkle with pecans, cranberries, and rosemary.",
        "cook_time": "10 mins",
        "comments": "Walnuts or almonds may be substituted for the pecans",
        "image_url": "https://www.allrecipes.com/thmb/Dg03p3Wg34f3MfpMJj6vYjzodS8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8541325_Baked-Brie-with-Honey-Pecans-and-Cranberries-lutzflcat_4x3-c8b98a7d428d40b49772364aa3f69c8a.jpg"
    },
    {
        "name": "Carrot Cake with Cream Cheese Frosting",
        "ingredients": "3 cups all-purpose flour,2 teaspoons baking powder,2 teaspoons ground cinnamon,1 teaspoon ground ginger, ½ teaspoon baking soda, ½ teaspoon salt, ¼ teaspoon ground nutmeg,¼ cup vegetable oil,¾ cup unsalted butter, 1 cup firmly packed dark brown sugar, ¾ cup white sugar,4 large eggs,1 cup buttermilk, 1 ½ cups grated carrot",
        "directions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 8-inch square pans and line the bottoms with parchment paper.Whisk flour, baking powder, cinnamon, ginger, baking soda, salt, nutmeg, cloves, and allspice together in a bowl; set aside. Beat butter, oil, brown sugar, and white sugar together in a large bowl with an electric mixer until light and fluffy. Add eggs one at a time, beating well after each addition. Beat batter for an additional 2 minutes after adding last egg. Beat in vanilla extract. Pour in half of the flour mixture; mix on low speed until just combined. Pour in buttermilk; mix until just combined. Pour in remaining flour mixture; mix until just combined. Fold in carrot, apple, raisins, and pecans.Divide batter evenly between the two pans. Spread into an even layer in each pan.Bake in the preheated oven until the top of the cake springs back lightly when touched and a toothpick inserted near the center comes out clean, 40 to 45 minutes. Allow cakes to cool in pans for 20 minutes; remove to a wire rack to cool completely, about 1 1/2 hours more.",
        "cook_time": "3 hrs 45 mins",
        "comments": "",
        "image_url": "https://www.allrecipes.com/thmb/l6eFIB7FiqVVoE0yf9zBCKHZGkg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/5369623-bca355bc7704437c9e0257dda89ac024.jpg"
    },
    {
        "name": "Chicken Fajita Burrito",
        "ingredients": "10 ounces boneless chicken breasts,½ onion, 5 ounces multi-colored bell pepper strips, 2 tabelspoons vegetable oil, lime juice, 2 tablespoons fajita seasoning, 4 flour tortillas, 1 cup beans, shredded chedder cheese, 1 ½ cups cooked Mexican rice,¼ cup sour cream, ⅓ cup guacamole",
        "directions": "Place chicken, onion, bell pepper, oil, lime juice, and fajita seasoning in a resealable plastic bag. Seal the bag and squeeze to ensure all ingredients are combined and well-coated; place in the refrigerator to marinate for 2 hours.Preheat the oven to 400 degrees F (200 degrees C). Line a sheet pan with foil. Spread fajita mixture onto sheet pan in a single layer.Bake in the preheated oven until chicken juices run clear, about 25 minutes. An instant-read thermometer inserted into the chicken strips should read 165 degrees F (74 degrees C).Wrap tortillas in a damp paper towel, and warm in the microwave until soft and pliable, about 30 seconds. To assemble burritos, spread 1/4 of each of the refried beans, cheese, rice, fajita mixture, sour cream, and guacamole in a line across the middle of each tortilla.Fold opposing sides of the tortilla in, overlapping the filling. Roll the bottom edge up tightly around the filling, then roll the burrito away from you, keeping the sides folded in.",
        "cook_time": "2 hrs",
        "comments": "Feel free to use frozen fajita vegetables. Allow vegetables to thaw before adding to marinade.",
        "image_url": "https://www.allrecipes.com/thmb/p1e_qhx-A0-21dZDxFyv1zBb-Zw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/8538304_Chicken-Fajita-Burrito_thedailygourmet_4x3-d381424d6949448596ef3dc66ce5712b.jpg"
    },
    {
        "name": "Tasty Onion Chicken",
        "ingredients": "1/2 cup butter, 1 tablespoon Worcestershire sauce, 1 tsp ground mustard, 1 can french-fried onions, 4 boneless skinless chicken breast halves",
        "directions": "In a shallow bowl, combine butter, Worcestershire sauce and mustard. Place onions in another shallow bowl. Dip chicken in butter mixture, then coat with onions.Place in a greased 11x7-in. baking dish; drizzle with remaining butter mixture. Bake, uncovered, at 400° for 20-25 minutes or until a thermometer reads 165°.",
        "cook_time": "25 mins",
        "comments": "",
        "image_url": "https://bing.com/th?id=OSK.68a8976ca52a58c1508850ed56890879"
    },
    {
        "name": "One-Pot Mac and Cheese",
        "ingredients": "3-1/2 cups whole milk, 3 cups water, 1 package elbow macaroni, 4 ounces Velveeta, 2 cups shredded cheddar cheese, 1/2 tsp salt, 1/2 tsp pepper",
        "directions": "In a Dutch oven, combine milk, water and macaroni; bring to a boil over medium heat. Reduce heat and simmer until macaroni is tender and almost all the cooking liquid has been absorbed, 12-15 minutes, stirring frequently. Reduce heat to low; stir in cheeses until melted. Season with salt and pepper",
        "cook_time": "15 mins",
        "comments": "You can make homemade mac and cheese creamier by cooking your pasta in milk. Try adding cream or yogurt to add in additional creaminess",
        "image_url": "https://southernbite.com/wp-content/uploads/2016/05/Easiest-One-Pot-Mac-and-Cheese-2.jpg"
    },
    {
        "name": "Shrimp Pasta Alfredo",
        "ingredients": "3 cups uncooked bow tie pasta, 2 cups frozen peas, 1 pound peeled and cooked shrimp, 1 jar alfredo sauce, 1/4 cup shredded parmesean cheese",
        "directions": "In a Dutch oven, cook pasta according to package directions, adding peas during the last 3 minutes of cooking; drain and return to pan.Stir in shrimp and sauce; heat through over medium heat, stirring occasionally. Sprinkle with cheese.",
        "cook_time": "25 mins",
        "comments": "",
        "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Easy-Marinated-Grilled-Flank-Steak_EXPS_FTTMZ19_32073_C03_05_5b_rms-5.jpg?fit=700,1024"
    },
    {
        "name": "Easy Marinated Grilled Flank Steak",
        "ingredients": "1 cup barbeque sauce, 1/2 cup burgundy wine, 1/4 cup lemon juice, 1 beef flank steak",
        "directions": "In a small bowl, whisk barbecue sauce, wine and lemon juice until blended. Pour 1 cup marinade into a shallow dish. Add beef and turn to coat. Cover; refrigerate 4 hours or overnight. Cover and refrigerate remaining marinade.Drain beef, discarding marinade in dish. Grill steak, covered, over medium heat until meat reaches desired doneness (for medium-rare, a thermometer should read 135°; medium, 140°; medium-well, 145°), 6-8 minutes on each side. Let stand 5 minutes before thinly slicing across the grain. Serve with reserved marinade.",
        "cook_time": "20 mins",
        "comments": "",
        "image_url": ""
    },
    {
        "name": "Chicken with Rosemary Butter Sauce",
        "ingredients": "4 boneless skinless chicken breasts, 4 tablespoons butter, 1/2 cup white wine, 1/2 cup heavy whipping cream, 1 tablespoon minced fresh rosemary",
        "directions": "In a large skillet over medium heat, cook chicken in 1 tablespoon butter until a thermometer reads 165°, 4-5 minutes on each side. Remove and keep warm.Add wine to pan; cook over medium-low heat, stirring to loosen browned bits from pan. Add cream and bring to a boil. Reduce heat; cook and stir until slightly thickened. Stir in rosemary and remaining 3 tablespoons butter until blended. Serve sauce with chicken.",
        "cook_time": "25 mins",
        "comments": "",
        "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Chicken-with-Rosemary-Butter-Sauce_EXPS_FT20_44349_F_0123_1-6.jpg?fit=700,1024"
    },
    {
        "name": "Fast Baked Fish",
        "ingredients": "1 pound fish fillet, 1 tsp salt, pepper to tasts, paprika to taste, 3 tablespoons melted butter",
        "directions": "Preheat oven to 400°. Place fish in a greased 11x7-in. baking dish. Sprinkle with seasoned salt, pepper and, if desired, paprika. Drizzle with butter.Cover and bake until fish just begins to flake easily with a fork, 15-20 minutes.",
        "cook_time": "30 mins",
        "comments": "Because fish is delicate and cooks quickly, flipping the fish isnt always necessary.",
        "image_url": "https://bing.com/th?id=OSK.c15640f0c98619bf6a597d8aaa90e1cf"
    },
    {
        "name": "Buffalo Chicken Sliders",
        "ingredients": "1 pound boneless chicken, 2 tablespoons louisiana-styl hot sauce, 1/4 tsp pepper, 1/4 cup butter, 1/4 cup honey",
        "directions": "Place chicken in a 3-qt. slow cooker. Toss with 2 tablespoons hot sauce and pepper; cook, covered, on low 3-4 hours or until tender.Remove chicken; discard cooking juices. In a small saucepan, combine butter, honey and remaining hot sauce; cook and stir over medium heat until blended. Shred chicken with 2 forks; stir into sauce and heat through. Serve on rolls with desired optional ingredients.",
        "cook_time": "20 mins",
        "comments": "Freeze cooled chicken mixture in freezer containers. To use, partially thaw in refrigerator overnight. Microwave, covered, on high in a microwave-safe dish until heated through, stirring occasionally; add water or broth if necessary.",
        "image_url": "https://img.buzzfeed.com/thumbnailer-prod-us-east-1/47a8817baf4c4dd58f3c221a0dac2545/BFV15883_GameDaySpreadRibsSlidersPretzelBombsTastyGameDay_TastyGrill_H264.jpg?output-format=auto&output-quality=auto&resize=600:*"
    }
]
